[
  {
    "slug": "the-journey-begins",
    "title": "The Journey Begins: How I'm Building My Path in Full-Stack Web Development",
    "excerpt": "I love building things that solve real problems. My journey in tech started with curiosity and led me to full-stack development.",
    "image": "/placeholder.svg",
    "category": "Career Tips",
    "date": "2024-12-08",
    "readTime": "15 min read",
    "featured": true,
    "content": "If there's one thing that defines my journey so far, it's this: I love building things that solve real problems.\n\nHello! I'm Cherag Saxena, a software engineer and full-stack web developer passionate about creating smooth, functional, and meaningful digital experiences. My path in tech has always been driven by curiosity — not just about how systems work, but how I can make them work better for people.\n\n## Where It All Started\n\nMy journey took shape when I stepped into B.Tech in Computer Engineering (Software Engineering) at Sage University. Here, I strengthened my foundation in programming, engineering principles, and real-world problem solving. At first, I explored many fields — AI, cloud, cybersecurity, and even geospatial tech — but with time, I realized something important:\n\nWeb development is where my creativity and engineering mindset truly come together.\n\nThe ability to design something from scratch, structure it, build logic behind it, and then bring it to life in the browser — that's what pulled me deep into full-stack development.\n\nDuring my first year, I earned the Best Excellence Award for First Year Academic Honors, which encouraged me to push further and explore my potential.\n\n## What I Build: Full-Stack Projects That Solve Problems\n\nOver time, I've built several projects that represent different parts of my learning and engineering approach:\n\n🔹 **CodeMentorAI** - A major full-stack platform designed and developed by me to support accessible and collaborative learning.\n\n🔹 **Track My Expenses** - My first full-stack MERN project, created to help users track, manage, and visualize their daily expenses.\n\n🔹 **Chatbox UI** - A clean and modern chat interface built with responsive design.\n\n🔹 **Book Store With Redux** - A fully state-managed React + Redux application showcasing scalable frontend patterns.\n\n🔹 **Redux Todo Manager** - A productivity app built with Redux to demonstrate clean component structure and state handling.\n\n🔹 **Weather Forecast App** - A simple, elegant interface that fetches real-time weather data using APIs.\n\nEach project reflects a step forward — new challenges, better architecture, more refined design, and a deeper understanding of full-stack development.\n\n## Skills That Shape My Work\n\nMy stack is simple but powerful:\n\n**Frontend:** React.js, JavaScript/TypeScript, HTML5/CSS3, Tailwind CSS, Next.js, Redux\n\n**Backend:** Node.js, Express.js, MongoDB, RESTful APIs, JWT Authentication, Database Design\n\n**Tools & DevOps:** Git/GitHub, VS Code, Netlify, Vercel, Figma\n\nThese aren't just skills I've learned — they're skills I've applied over and over in real projects.\n\n## Experience & Internships\n\nMy learning extends beyond projects. I've gained practical, hands-on experience through internships and industry programs:\n\n- 3-Week Full-Stack Development Internship (VGT under MSME)\n- Web Development Internship with My Job Grow + Techfest IIT Bombay\n- Multiple guided programs strengthening my skills in React, Redux, JavaScript, Node.js, and backend workflows\n- Real-world project experience involving responsive UI, API integration, clean code, and scalable app structure\n\nThese experiences helped me understand industry expectations and improved the way I approach building production-level applications.\n\n## Why I'm Writing This Blog\n\nThis blog marks a new chapter for me. I've built projects, learned new technologies, completed internships, and explored different directions — now I want to:\n\n- Share my journey\n- Document what I learn\n- Explain the challenges behind building full-stack applications\n- Break down my projects\n- Share experiences from internships\n- Talk about tools, frameworks, and concepts I work with\n- Help others who are just getting started\n\n## What's Coming Next\n\nHere's what I'll be writing about in the upcoming blogs:\n\n- How I Built Track My Expenses: From Idea to Deployment\n- My Internship & Real-World Experience\n- Exploring AI, Cloud Computing, Cybersecurity & Beyond\n- The Full Story Behind CodeMentorAI\n- My Journey Into Next.js\n- Learning UI/UX as a Full-Stack Developer"
  }
]
